define s = Character('Саша', color="#70d870")
define d = Character('Дима', color="#ff8945")
define da = Character('Даша', color="#ffaee4")
define t = Character('Михаил Степанович', color="#fbffc8")
define m = Character('Мама', color="#fbffc8")
define mi = Character('Мишаня', color="#f02020")
define cl = Character('Класс', color="#5e20f0")
#define dissolve = Dissolve(0.7)
define sdissolve = Dissolve(2)
define fdissolve = Dissolve(0.3)

label start:       
    scene attention with sdissolve
    $ renpy.pause(3, hard=False)
    scene black_bg with dissolve

label act1:
    scene schoola with sdissolve

    #'Конец учебного года..'
    #d 'Май уже кончается.. Стоит ли пойти в 11 класс, или правильнее будет уйти в колледж?'
    #d 'Сдать егэ я наверняка не смогу, но большинство моих знакомых, выпустившихся из 9 класса многого не добились..'
    #d 'Ладно, тот факт, что я не могу сдать егэ, решает этот вопрос, посмотрим, куда я могу поступить с моими результатами огэ..'
    
    ''
    d 'Ну вот и закончился мой 10 класс.'

    'Из школы выбегали счастливые младшеклассники, радующиеся долгожданному окончанию учебного года.'
    'Однако Дима впервые не испытывал положительных эмоций от наступления каникул.'

    d 'И что же теперь? {w}Как вообще так получилось?'
    d 'Изначально я хотел поступить в колледж, но меня не взяли из-за нехватки мест.'
    d 'Пришлось остаться в школе и провести ещё год в десятом классе. Теперь уже не очень хочется идти в этот колледж.'
    d 'С другой стороны, если пойти в одинадцатый, то непонятно, смогу ли я потом поступить в вуз со своими-то знаниями…'
    d 'А может вообще заключить военный контракт?..'

    show dasha_open_close with dissolve

    da 'Эй, Дима! {w}Чего такой хмурый? {w}О чем задумался?'

    d 'Привет, Даша. Да ни о чем особенном, не выспался просто...'

    show dasha_smile with fdissolve
    hide dasha_open_close
    
    'Даша, как и другие ученики, сияла от счастья.'
    'Ну а чего грустить? Она ж отличница, ей не о чем переживать.'

    show dasha_open with fdissolve 
    hide dasha_smile

    da 'Целое лето впереди, успеешь отоспаться!'

    d 'Ага.'

    show dasha_open_close with fdissolve
    hide dasha_open

    da 'Ну ладно, счастливо тебе! Желаю продуктивно провести каникулы!'

    d 'Спасибо, Даш! Тебе того же! {w}Бай!'

    hide dasha_open_close with dissolve

    'Продуктивно провести каникулы... Пойду с кентами что ли встречусь?'

    scene black_bg with sdissolve
    scene bg mall with fade
    ''   
    d 'Ооо, Мишаня!'

    show misha_smile with dissolve

    mi 'Дарова, братан!'

    d 'Чем на каникулах заниматься будешь?'

    show misha_relax with fdissolve
    hide misha_smile 
    mi 'Да хз, брат, ващеее.'

    show misha_smile with fdissolve
    hide misha_relax 
    mi 'Как обычно на районе зависать, наверное, буду. С пацанами тусоваться.'

    d 'Аа, ну понятно.'

    mi 'А ты, брат, че спрашиваешь? {w}Сам-то че делаеть будешь?'

    d 'Эээ, не знаю, даже... Думаю, надо мне подучиться немного, русский может подтяну!'

    show misha_angry with fdissolve
    hide misha_smile 
    mi 'Чёёёё?! Учиться? Ахахахаха!'
    mi 'Тебе, брат, зачем этот русский понадобилcя?'

    d 'Как это зачем? Это наш родной язык вообще-то. А еще мне экзамен по нему через год сдавать, возможно...'

    show misha_smile with fdissolve
    hide misha_angry 
    mi 'Брат, ну ты даёшь! Сам же сказал, что родной язык, зачем его учить?'

    d 'Потому что знаю его на недостаточном уровне, а экзамен оооочень сложный!'

    mi 'Решил заучкой, брат, стать? Ну дело твоё, брат.'

    'От Мишиных слов мне стало не по себе. Наверное, он не самый подходящий человек для разговоров об учебе.'

    d 'Проехали. Пойдем по району прошвырнемся.'

    show misha_relax with fdissolve
    hide misha_smile 
    mi 'Ну пойдем, брат!'

    scene black_bg with sdissolve
    'Мы встретили еще пару друзей и отлично провели время.'

    scene bg room 2 with sdissolve
    'Как же я устаа-ал... {w} Сил вообще нет.'
    'К экзаменам готовиться начну с завтрашнего дня! Ещё все лето впереди!'

label summerEnd:
    scene black_bg with sdissolve
    'Так и пролетело все моё лето.'

    #
    'Все каникулы я просидел, катая в кс и доту, откладывая подготовку на следующий день...'
    'Такое ощущение, что я забыл абсолютно все, что удалось выучить в 10 классе.'
    'В коледж доументы отдать я так и не решился.'
    scene bg room 2 with dissolve
    '1 сентября уже завтра, но мне так не хочется никуда идти...'

label act2:
    #scene bg room with dissolve
    #'Яркие солнечные лучи, ложась посреди комнаты, проникают сквозь окно и ослепляют глаза сквозь веки..'
    #'И снова нужно идти в школу... Почему я должен учиться? Каждый день делать глупую домашнюю работу. Никакой пользы от этого! Я стану профессиональным спортсменом, и этого достаточно!'
    #'Ладно, учиться осталось всего год, пора на учёбу..'

    scene black_bg with sdissolve
    'На следующее утро.'

    scene bg room with dissolve
    'К удивлению, наутро мое настроение значительно улучшилось и стало просто боевым!'
    'Погода была просто чудесная, и меня разрывало от прилива энергии.'
    d 'Прямо не терпится встретить своих школьных кентов!'
    d 'Ну-с, Let`s go!'

    scene bg school with fade
    'Вот и школа... Последний год...'

    scene class 1 with fade
    ''
    show sasha 1 with easeinright
    s 'Дарова, Димас! Как провел каникулы?'

    d 'Привет! Да ничего особенного, просрал все лето подчистую.'
    
    s 'База, брат.'
    s 'Кстати, видел обновление в toda 2? Игру с ног на голову перевернули!'

    d 'Серьёзно? {w}Пол лета в toda катал. Как эта новость мимо меня прошла?! {w} Надо будет взглянуть!'
    hide sasha 1 with dissolve
    show dasha2_smile_close with dissolve


    da 'Опять вы про свои игры? Хоть бы о будущем задумались!'
    hide dasha2_smile_close with dissolve
    show sasha mad with dissolve


    s 'Не твоё дело, чем хотим, тем и занимаемся! Пошла на***, шл***!'

    hide sasha mad with dissolve
    show dasha_sad_blush with dissolve
    
    d 'Эээ, Саня, ты че такой злой? Что-то обновления в toda 2 на тебя плохо повлияли.'
    
    hide dasha_sad_blush with moveoutright

    d 'Ну вот! Даша обиделась, тебе нужно будет извиниться перед ней.'

    show sasha sigma with dissolve
    
    s 'Да за что извиняться? Я вообще-то сигма.'

    s 'Ой, учитель пришел, мне пора.'

    hide sasha sigma with dissolve
    scene class 3 4 with sdissolve

    show teacher_smile with dissolve

    t 'Здравствуйте, ребята, меня зовут Михаил Степанович, в этом году я буду вашим учителем, надеюсь на ваше усердие в учёбе!'

    d 'А почему вы курите в школе?!'

    t 'А тебя это волновать не должно! Дыма нет, значит не считается!'
    t 'Так класс, мне нужно определить ваш текущий уровень знаний. {w} Сегодня проведем вступительные контрольные работы по русскому и математике.'

    cl 'О нееет!' 

    scene black_bg with dissolve



    scene bg school 2 with dissolve
    'На следующий день, в школе..'
    show dasha 2
    da 'Привет!'
    show dasha 1
    da 'Выглядишь недовольным..'
    d 'Учитель неудовлетворён моими знаниями в математике, почему я должен терпеть его замечания? Мне эта математика вообще не нужна!'
    show dasha 4
    da 'Ты не прав, Дима, Учёба — это возможность открыть новые горизонты. Чтобы внести свой вклад в развитие и улучшение жизни людей, нужно постоянно обучаться новому. Хочешь я помогу тебе разобраться?'
    'Может мне действительно стоит попробовать?..'
    d 'Хорошо, если ты мне поможешь, я постараюсь пересмотреть своё мнение об учёбе'
    show dasha 2
    da 'Отлично! Тогда будем учиться каждый день в библиотеке.'

    scene bg library with dissolve
    'После уроков'
    d 'Чёрт! Я не могу это решить. Почему это так сложно?'
    show dasha 2
    da 'Все начинают с трудностей, Дима. Главное — не сдаваться. Если ты перечитаешь материал урока, то сразу всё поймешь, можешь задавать мне вопросы, если что-то непонятно'
    d 'Хорошо, я постараюсь разобраться..'

    scene bg class with dissolve
    'Месяц спустя..'
    show teacher 1
    t 'Результаты контрольной работы сильно меня удивили, особенно хочется отметить Дмитрия, который не только правильно решил все задания, но и написал подробное решение с пояснениями, берите пример с него!'
    'Отлично! Дополнительные занятия приносят плоды'
    t 'Свои работы можете забрать на столе'
    t 'Ладно, не буду вас задерживать, урок окончен!'

    scene bg school 2 with dissolve
    show sasha poke
    s 'Как ты умудрился так хорошо написать контрольную?'
    d 'Я всего лишь стал уделять больше времени математике, попробуй тоже, уверен, ты быстро достигнешь успехов'
    s 'Скукота! Делать мне больше нечего?'
    s 'Кстати, завтра с ребятами собирались прогуляться вечером, ты как?'
    d 'Я хочу сосредоточиться на учёбе, думаю, у меня не будет времени на это, извини'
    s 'Что?! Ты не будешь с нами гулять? Ты совсем с ума сошёл со своей учёбой?'
    d 'Достичь чего-то значимого можно только отказавшись от приятного - вот, что я понял за этот месяц'
    s 'Не забивай себе голову! Лучше бы с нами пошёл, было бы весело!'
    menu optional_name:
        'Прости, не могу':
            scene bg room with dissolve
            'Я неплохо подтянул свои знания по всем предметам за эти полгода, Даша мне здорово помогла'
            'Думаю, продолжая в том же духе я смогу основательно подготовиться к экзаменам. Да, пожалуй, стоит выбрать университет, в который я собираюсь поступить'

            scene bg library with dissolve
            show dasha 2
            da 'Ты молодец, Дима! Уверена, что ты сможешь добиться многого, если будешь продолжать в том же духе!'
            d 'Это всё благодаря тебе, спасибо! Теперь я понял, что учёба — это не только оценки, но и возможность развиваться'
            da 'Мы хорошо поработали, думаю, надо хоть иногда отдыхать на свежем воздухе'
            d 'Согласен, от учёбы тоже нужно отдыхать'

            scene bg street with dissolve
            dr 'Давно я вот так не выходил прогуляться..'
            show dasha 4
            da 'О чём задумался?'
            d 'Грустно, что я стал гораздо реже проводить время с друзьями'
            hide dasha 4
            show dasha 1
            d 'Я наверняка потеряю своих друзей, занимаясь учёбой так усердно..'
            da 'В жизни часто приходится чем-то жертвовать, но не стоит об этом сильно переживать'
            hide dasha 1
            show dasha 2
            da 'Ведь настоящие друзья всегда тебя поддержат'
            d 'Ты права, спасибо, что успокоила'

            scene bg library with dissolve
            d 'Хорошо, время написать пробники!'
            #Возможно тут должна быть мини-игра

            scene bg class with dissolve
            'Не могу перестать волноваться, всё-таки еще год назад я почти ничего не мог решить'
            'Точно, весь этот год я старательно трудился, отказываясь от удовольствий, я не могу вот так впустую всё это выбросить..'
            'Я справлюсь!'
            #А может тут должна быть мини-игра, кто знает...

            scene bg room with dissolve
            'Пришли результаты экзаменов'
            'Больше всего я переживаю за математику, но я уверен в том, что всё правильно написал...'
            'Обалдеть! 97 баллов! Ещё и лучший результат в классе! Теперь у меня даже есть чем похвастать перед друзьями'
            'Хотя это во многом благодаря Даше, надо будет ещё раз её поблагодарить'
            'Ну, с такими результатами мне открыты все дороги, выберусь в большой город и продолжу учиться. Учёба - тяжёлый путь, но награда в его конце лучше любых развлечений!'

            scene bg class with dissolve
            show sasha 2
            s 'Привет! Твои результаты меня удивили! Я вот набрал всего 23 первичных балла...'
            d 'Это потому что я усердно учился день за днём, а ты даже не хотел признавать важность учёбы'
            d 'Обучение помогло мне не только узнать много нового, но и стать полезнее для других людей - это основа правильной жизни'
            s 'Да уж.. Жаль, что я с тобой не соглашался, но теперь я готов начать учиться!'
            d 'Рад, что ты наконец задумался о будущем, если что, обращайся за помощью'
            s 'Хорошо, спасибо тебе!'
        'Да, ты прав, от весёлого времяпровождения не стоит отказываться!':
            s 'Вот это другое дело! Завтра мы отлично оторвёмся! Хе-хе'

            scene bg street 2 with dissolve
            'На следующий день, нагулявшись вдоволь, все расходятся по домам..'
            s 'Хорошо же прогулялись? А ты идти не хотел'
            d 'Да, было весело, но почему-то я чувствую, будто что-то не так'
            s 'Хватит жути наводить, что может быть не так?'
            d 'Я не знаю, чувствую, словно я что-то забыл'
            s 'Вряд ли это что-то очень важное, не задумывайся'
            d 'Наверное ты прав, ну ладно, до завтра'
            s 'Пка'

            scene bg room 2 with dissolve
            'А в темноте не так уж и страшно гулять, надо будет как-нибудь повторить'
            'Даже сейчас ещё бы погулял'
            'Точно, выброшу мусор, заодно подышу свежим воздухом..'
            menu bebebe:
                'Выбросить мусор?'
                'Выбросить':
                    scene bg street 3 with dissolve
                'Выбросить утром':
                    scene bg room
                    'bebebe'
                

        
    return